studies/LidDrivenCavity/case/system/controlDict
FoamFile { version 2.0; format ascii; class dictionary; object controlDict; }

application     icoFoam;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         30;      // total simulation time

// time step control
adjustTimeStep  yes;
// maximum stability limit (max CFL number)
// for icofam/pimpleFoam, 0.5 is a safe value, for Navier-Stokes solvers its often set to 1
maxCo           0.5;
// maximum time step size (for safety, to avoid too large time steps in case of high velocities)
maxDeltaT       2;

// initial time step (OpenFOAM will adjust it immediately after the first step)
deltaT          0.5;

writeControl    runTime;
writeInterval   2;      // time step for saving results