studies/LidDrivenCavity/case/system/fvSchemes
FoamFile { version 2.0; format ascii; class dictionary; object fvSchemes; }

ddtSchemes { 
    default Euler; // temporal discretisation scheme 
    }   
gradSchemes { 
    default cellLimited Gauss linear 1; // spatial discretisation scheme for gradient 
    grad(U)         Gauss linear;
}
divSchemes { 
    // "linearUpwind" is a good compromise for precision and stability in laminar flows
    div(phi,U)      Gauss linearUpwind grad(U); 
    
    // The rest can remain as "linear" for a laminar flow
    div(phi,k)      Gauss upwind; // (if you were using turbulence)
} 
laplacianSchemes { 
    default Gauss linear corrected; // spatial discretisation scheme for laplacian 
    // (corrected = better precision near boundaries)
    } 
interpolationSchemes { 
    default linear; // interpolation scheme for scalar and vector fields 
    } 
snGradSchemes { 
    default corrected; // spatial discretisation scheme for normal gradient 
    } 