studies/LidDrivenCavity/case/system/fvSolution
FoamFile { version 2.0; format ascii; class dictionary; object fvSolution; }

// Définition des solveurs pour la pression (p) et la vitesse (U)
solvers
{
    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0.05;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    U
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          0.1;
    }
}

// PISO solver parameter (Pressure Implicit with Splitting of Operators)
PISO { 
    nCorrectors 3; 
    nNonOrthogonalCorrectors 1; // mesh corrector for non-orthogonal meshes  
    pRefCell 0; 
    pRefValue 0; 
    }

