studies/LidDrivenCavity/case/system/sampleDict
// creates a set of points along a vertical line at x=0.5, from y=0 to y=1, with 50 points
// saves the velocity field U at those points in CSV format at each time step defined by writeInterval.

type            sets;
libs            ("libsampling.so");
setFormat       csv;
interpolationScheme cell;
fields          (U);
sets
{
    verticalLine
    {
        type            polyLine;
        axis            y;
        nPoints         50;
        points          ((0.05 0 0) (0.05 0.1 0)); // line start and end points
    }
}

// after the calculation is done, use the command: postProcess -func sampleDict -latestTime in the terminal
